// 这个数据是 2016-4  到 2017-3
var data = {
    '1': {
        '41': 86600,
        '42': 86700,
        '43': 86800,
        '44': 86900,
        '45': 86900,
        '46': 86900,
        '47': 87000,
        '48': 87000,
        '49': 87000,
        '50': 87100,
        '51': 87100,
        '52': 87100,
        '53': 87100,
        '54': 87100,
        '55': 87200,
        '56': 87200,
        '57': 87300,
        '58': 87400,
        '59': 87500,
        '60': 87600
    },
    '2': {
        '41': 87100,
        '42': 87200,
        '43': 87200,
        '44': 87200,
        '45': 87300,
        '46': 87400,
        '47': 87400,
        '48': 87500,
        '49': 87500,
        '50': 87500,
        '51': 87600,
        '52': 87600,
        '53': 87700,
        '54': 87800,
        '55': 87900,
        '56': 88000,
        '57': 88100,
        '58': 88100,
        '59': 88200,
        '60': 88200
    },
    '3': {
        '41': 86900,
        '42': 86900,
        '43': 86900,
        '44': 86900,
        '45': 86900,
        '46': 86900,
        '47': 86900,
        '48': 86900,
        '49': 87000,
        '50': 87000,
        '51': 87200,
        '52': 87200,
        '53': 87300,
        '54': 87400,
        '55': 87500,
        '56': 87600,
        '57': 87700,
        '58': 87700,
        '59': 87800,
        '60': 87800
    },
    '4': {
        '41': 84100,
        '42': 84200,
        '43': 84300,
        '44': 84300,
        '45': 84300,
        '46': 84300,
        '47': 84400,
        '48': 84400,
        '49': 84400,
        '50': 84500,
        '51': 84500,
        '52': 84500,
        '53': 84600,
        '54': 84600,
        '55': 84700,
        '56': 84800,
        '57': 84800,
        '58': 84900,
        '59': 85000,
        '60': 85100
    },
    '5': {
        '41': 84000,
        '42': 84000,
        '43': 84000,
        '44': 84100,
        '45': 84100,
        '46': 84200,
        '47': 84300,
        '48': 84300,
        '49': 84300,
        '50': 84400,
        '51': 84400,
        '52': 84400,
        '53': 84500,
        '54': 84500,
        '55': 84600,
        '56': 84700,
        '57': 84800,
        '58': 84900,
        '59': 84900,
        '60': 85000
    },
    '6': {
        '41': 84000,
        '42': 84000,
        '43': 84100,
        '44': 84200,
        '45': 84200,
        '46': 84200,
        '47': 84200,
        '48': 84200,
        '49': 84200,
        '50': 84200,
        '51': 84200,
        '52': 84200,
        '53': 84200,
        '54': 84200,
        '55': 84300,
        '56': 84300,
        '57': 84300,
        '58': 84300,
        '59': 84300,
        '60': 84400
    },
    '7': {
        '41': 86100,
        '42': 86200,
        '43': 86300,
        '44': 86300,
        '45': 86300,
        '46': 86400,
        '47': 86500,
        '48': 86500,
        '49': 86600,
        '50': 86600,
        '51': 86600,
        '52': 86700,
        '53': 86800,
        '54': 86900,
        '55': 86900,
        '56': 87000,
        '57': 87100,
        '58': 87100,
        '59': 87200,
        '60': 87200
    },
    '8': {
        '41': 85800,
        '42': 85800,
        '43': 85900,
        '44': 86000,
        '45': 86000,
        '46': 86100,
        '47': 86200,
        '48': 86200,
        '49': 86200,
        '50': 86300,
        '51': 86300,
        '52': 86300,
        '53': 86300,
        '54': 86400,
        '55': 86400,
        '56': 86400,
        '57': 86600,
        '58': 86700,
        '59': 86800,
        '60': 86900
    },
    '9': {
        '41': 85400,
        '42': 85400,
        '43': 85400,
        '44': 85500,
        '45': 85600,
        '46': 85700,
        '47': 85700,
        '48': 85900,
        '49': 85900,
        '50': 85900,
        '51': 85900,
        '52': 85900,
        '53': 86000,
        '54': 86000,
        '55': 86000,
        '56': 86100,
        '57': 86200,
        '58': 86200,
        '59': 86300,
        '60': 86500
    },
    '10': {
        '41': 87500,
        '42': 87500,
        '43': 87600,
        '44': 87700,
        '45': 87700,
        '46': 87900,
        '47': 87900,
        '48': 88000,
        '49': 88000,
        '50': 88000,
        '51': 88000,
        '52': 88000,
        '53': 88000,
        '54': 88000,
        '55': 88100,
        '56': 88100,
        '57': 88100,
        '58': 88100,
        '59': 88200,
        '60': 88300
    },
    '11': {
        '41': 87700,
        '42': 87700,
        '43': 87700,
        '44': 87700,
        '45': 87700,
        '46': 87700,
        '47': 87700,
        '48': 87800,
        '49': 87800,
        '50': 87700,
        '51': 88000,
        '52': 88100,
        '53': 88100,
        '54': 88200,
        '55': 88300,
        '56': 88400,
        '57': 88500,
        '58': 88500,
        '59': 88600,
        '60': 88600
    },
    '12': {
        '41': 87400,
        '42': 87400,
        '43': 87400,
        '44': 87500,
        '45': 87600,
        '46': 87700,
        '47': 87700,
        '48': 87800,
        '49': 87800,
        '50': 87900,
        '51': 87900,
        '52': 87900,
        '53': 87900,
        '54': 88000,
        '55': 88000,
        '56': 88000,
        '57': 88100,
        '58': 88100,
        '59': 88200,
        '60': 88300
    }
}


// 获取在某一秒加价多少必成功的
function getPrePrice(preTime, data) {
    const dealPrice = data[60];

    let prePrices = [];
    for (let delta = 100; delta <= 300; delta += 100) {
        prePrices.push(dealPrice + delta - data[preTime]);
    }
    return prePrices;
}

// 获取在某一秒加多少价格必成功的次数
function getByPreTime(preTime) {
    let arr = [];
    for (let i = 1; i <= 12; i++) {
        arr = arr.concat(getPrePrice(preTime, data[i]));
    }

    let obj = {};
    arr.forEach(d => {
        if (typeof obj[d] == 'undefined') obj[d] = 0;
        obj[d]++;
    })
    return obj;
}

//for (let i = 41; i < 60; i ++) {
//console.log(i, getByPreTime(i));
//}



// 获取某月加价时间加某个价格 可以拍到
function getIncreaseTime(preTime, prePrice, month) {
    let monData = data[month];
    let finallyPrice = monData[preTime] + prePrice;

    return Object.keys(monData).find(key => {
        return (monData[key] + 300 >= finallyPrice) && finallyPrice > monData[60];
    }) || false;
}

//for (let i = 1; i <= 12; i ++) {
//console.log(i, getIncreaseTime(45, 1000, i));
//}

// 不考虑排队 在某月 某秒 加价 某个价格 是否可以拍到 
function canSuccessIncreaseTime(preTime, prePrice, month) {
    let monData = data[month];
    let finallyPrice = monData[preTime] + prePrice;
    return finallyPrice - monData[60] >= 100;
}

// 在preTime 加价 prePrice，submitTime 时候 排队queue 秒 是否成功

function getStatusWithQueue(preTime, prePrice, submitTime, queue, month) {
    if (submitTime + queue >= 60) {
        return false;
    }
    let monData = data[month];
    let finallyPrice = monData[preTime] + prePrice;
    return monData[submitTime + queue] + 300 >= finallyPrice;
}

// 获取某月某秒 多少个排队时间情况可以成功
function getSuccessCountWithSubmitTime(preTime, prePrice, submitTime, month) {
    let maxQueue = 60 - submitTime - 1;
    let count = 0;
    for (let i = 0; i < maxQueue; i++) {
        if (getStatusWithQueue(preTime, prePrice, submitTime, i, month)) {
            count++;
        }
    }
    return count;
}



// 在加价预算的概率相同的情况下，固定提交价格，根据排队状况来看各个情况的概率
var m = [
    [41, 1200],
    [42, 1200],
    [45, 1000],
    [51, 700],
    [48, 700]
];
// 总共成功的次数 不同时间
let successCount = [];
// 总共成功的月数
let successMonthCount = [];
for (let i = 1; i <= 12; i++) {
    m.forEach(x => {
        if (typeof successCount[x[0]] == 'undefined') successCount[x[0]] = 0;
        if (typeof successMonthCount[x[0]] == 'undefined') successMonthCount[x[0]] = 0;
        successCount[x[0]] += getSuccessCountWithSubmitTime(x[0], x[1], 55, i);
        if (successCount[x[0]] != 0) {
            successMonthCount[x[0]]++;
        }
    });
}


// 写完了代码，看完了一些数据，感觉，其实也没有卵用主要还是看运气。